# Pandas Operations Full Practice
This notebook covers data processing, normalization, manipulation, analysis, grouping, aggregation, and joins using Pandas.

In [2]:
import pandas as pd

## Load Dataset

In [3]:
df = pd.read_csv('pandas_employees.csv')
df.head()

   id    name department        city  salary  experience
0   1  Sanjog         IT     Pokhara   50000           1
1   2  Bikash         HR   Kathmandu   45000           2
2   3    Amit    Finance      Butwal   70000           5
3   4    Sita         IT    Lalitpur   52000           3
4   5    Gita         HR  Biratnagar   48000           2

## Data Processing with Pandas

In [4]:
df.info()
df.describe()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40 entries, 0 to 39
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          40 non-null     int64
 1   name        40 non-null     object
 2   department  40 non-null     object
 3   city        40 non-null     object
 4   salary      40 non-null     int64
 5   experience  40 non-null     int64
dtypes: int64(3), object(3)
memory usage: 2.0+ KB

id            0
name          0
department    0
city          0
salary        0
experience    0
dtype: int64

## Data Normalization in Pandas

In [5]:
df['salary_normalized'] = (df['salary'] - df['salary'].min()) / (df['salary'].max() - df['salary'].min())
df[['salary','salary_normalized']].head()

   salary  salary_normalized
0   50000           0.151515
1   45000           0.000000
2   70000           0.757576
3   52000           0.212121
4   48000           0.090909

## Data Manipulation in Pandas

In [6]:
df['annual_salary'] = df['salary'] * 12
df['level'] = df['experience'].apply(lambda x: 'Senior' if x >= 7 else 'Junior')
df.head()

,id,name,department,city,salary,experience,salary_normalized,annual_salary,level
0,1,Sanjog,IT,Pokhara,50000,1,0.151515,600000,Junior
1,2,Bikash,HR,Kathmandu,45000,2,0.000000,540000,Junior
2,3,Amit,Finance,Butwal,70000,5,0.757576,840000,Junior
3,4,Sita,IT,Lalitpur,52000,3,0.212121,624000,Junior
4,5,Gita,HR,Biratnagar,48000,2,0.090909,576000,Junior

## Data Analysis using Pandas

In [7]:
df['salary'].mean()
df['salary'].max()
df['salary'].min()
df['department'].value_counts()

department
IT         16
HR         12
Finance    12
Name: count, dtype: int64

## Grouping and Aggregating with Pandas

In [8]:
grouped = df.groupby('department').agg({'salary': ['mean','max','min'],'experience': 'mean'})
grouped

                  salary               experience
                    mean    max    min       mean
department
Finance     74000.000000  78000  70000   7.666667
HR          48166.666667  51000  45000   3.583333
IT          57500.000000  65000  50000   5.625000

## Creating Second DataFrame for Joins

In [9]:
dept = pd.DataFrame({'department': ['IT','HR','Finance'],'manager': ['Ram','Shyam','Hari']})
dept

  department manager
0         IT     Ram
1         HR   Shyam
2    Finance    Hari

## Different Types of Joins in Pandas

In [10]:
inner_join = pd.merge(df, dept, on='department', how='inner')
left_join = pd.merge(df, dept, on='department', how='left')
right_join = pd.merge(df, dept, on='department', how='right')
outer_join = pd.merge(df, dept, on='department', how='outer')
inner_join.head(), left_join.head(), right_join.head(), outer_join.head()

(   id    name department        city  salary  experience  salary_normalized  \
 0   1  Sanjog         IT     Pokhara   50000           1           0.151515
 1   2  Bikash         HR   Kathmandu   45000           2           0.000000
 2   3    Amit    Finance      Butwal   70000           5           0.757576
 3   4    Sita         IT    Lalitpur   52000           3           0.212121
 4   5    Gita         HR  Biratnagar   48000           2           0.090909

    annual_salary   level manager
 0         600000  Junior     Ram
 1         540000  Junior   Shyam
 2         840000  Junior    Hari
 3         624000  Junior     Ram
 4         576000  Junior   Shyam  ,
    id    name department        city  salary  experience  salary_normalized  \
 0   1  Sanjog         IT     Pokhara   50000           1           0.151515
 1   2  Bikash         HR   Kathmandu   45000           2           0.000000
 2   3    Amit    Finance      Butwal   70000           5           0.757576
 3   4    Sita         IT    Lalitpur   52000           3           0.212121
 4   5    Gita         HR  Biratnagar   48000           2           0.090909

    annual_salary   level manager
 0         600000  Junior     Ram
 1         540000  Junior   Shyam
 2         840000  Junior    Hari
 3         624000  Junior     Ram
 4         576000  Junior   Shyam  ,
    id    name department        city  salary  experience  salary_normalized  \
 0   1  Sanjog         IT     Pokhara   50000           1           0.151515
 1   4    Sita         IT    Lalitpur   52000           3           0.212121
 2   7   Nabin         IT   Kathmandu   51000           4           0.181818
 3  10   Kiran         IT  Biratnagar   54000           5           0.272727
 4  11  Manish         IT     Pokhara   56000           6           0.333333

    annual_salary   level manager
 0         600000  Junior     Ram
 1         624000  Junior     Ram
 2         612000  Junior     Ram
 3         648000  Junior     Ram
 4         672000  Junior     Ram  ,
    id   name department      city  salary  experience  salary_normalized  \
 0   3   Amit    Finance    Butwal   70000           5           0.757576
 1   6   Hari    Finance   Pokhara   75000           6           0.909091
 2   9  Pooja    Finance  Lalitpur   73000           7           0.848485
 3  13  Rohit    Finance    Butwal   71000           8           0.787879
 4  16  Rekha    Finance   Pokhara   76000           7           0.939394

    annual_salary   level manager
 0         840000  Junior    Hari
 1         900000  Junior    Hari
 2         876000  Senior    Hari
 3         852000  Senior    Hari
 4         912000  Senior    Hari  )

## Save Final Processed Data

In [11]:
df.to_csv('processed_employees.csv', index=False)